{
  "About": {
    "content_10": "hehe.",
    "content_9": "here",
    "content_8": "Oh, this place is where I write down my various articles. If you're interested, feel free to drop by",
    "content_7": "I have many hobbies such as watching movies, listening to music, playing piano, playing games, meeting friends... and especially drinking 😄!!",
    "content_6": "Look at the screen all day without entertainment is not good, so I always maintain a balance between work and relax.",
    "content_5": "Even though I am a software engineer, I always maintain my own identity, show my own personality and make my mark in both work and life..",
    "content_4": "I am still trying to better myself. Whatever I know, I share wholeheartedly, hoping to be of help to others in some way.",
    "content_3": "Luckily, in my second year of university, I found an internship to learn and improve my skills.",
    "content_2": "I'm also an IT student majoring in computer science at VKU at Da Nang City.",
    "content_1": "Currently, I am a Front End Engineer, and I am also trying to become a Blogger.",
    "title_2": "Thank you for visiting my page! I will provide a brief summary of myself below.",
    "title": "Who Am I ?"
  },
  "Contact": {
    "message": "You can also message me privately through:",
    "anyQuestion": "Have any questions?",
    "title_2": "Feel free to reach out if you want to build something together, have a question, or just want to connect.",
    "title": "Contact!"
  },
  "SiderBar": {
    "design_2": "Design prototype is available on ",
    "design_1": "Designed by me © 2024.",
    "about": "About Me",
    "experiences": "Experiences",
    "blogs": "My Blogs",
    "contact": "Contact",
    "projects": "Projects"
  },
  "HomePage": {
    "content_fe": "Front-end engineering.",
    "content_3": "With a detail oriented-focus, I enjoy creating simple but effective solutions to improve application performance, ease of maintenance, and user experience.",
    "content_2": "My areas of interest include problem-solving, cloud computing and with a strong focus on the role of a",
    "content_1": "I'm currently a software engineer.",
    "title_1": "Hello,",
    "title_2": "My name is Nam!"
  }
}
